const config = require('../config')
const { cmd, commands } = require('../command');

cmd({
    pattern: "list",
    alias: ["listcmd","menu3","commands"],
    desc: "menu the bot",
    category: "menu",
    react: "⚡",
    filename: __filename
}, 
async (conn, mek, m, { from, quoted, body, isCmd, command, args, q, isGroup, sender, senderNumber, botNumber2, botNumber, pushname, isMe, isOwner, groupMetadata, groupName, participants, groupAdmins, isBotAdmins, isAdmins, reply }) => {
    try {
        let dec = `╭━❮ *𝐃𝐎𝐖𝐍𝐋𝐎𝐀𝐃 𝐂𝐌𝐃* ❯━┈⊷
┃▸
┃▸📖 𝐂𝐎𝐌𝐌𝐀𝐍𝐃: .ᴘʟᴀʏ
┃▸ℹ️ ᴅᴏᴡɴʟᴏᴀᴅ ᴀᴜᴅɪᴏ ғʀᴏᴍ ʏᴛ
┃▸ 
┃▸📖 𝐂𝐎𝐌𝐌𝐀𝐍𝐃: .sᴏɴɢ
┃▸ℹ️ ᴅᴏᴡɴʟᴏᴀᴅ sᴏɴɢ ғʀᴏᴍ ʏᴛ
┃▸ 
┃▸📖 𝐂𝐎𝐌𝐌𝐀𝐍𝐃: .ᴀᴘᴋ
┃▸ℹ️ ᴅᴏᴡɴʟᴏᴀᴅ ᴀᴘᴋ ғʀᴏᴍ ᴘʟᴀʏsᴛᴏʀᴇ
┃▸ 
┃▸📖 𝐂𝐎𝐌𝐌𝐀𝐍𝐃: .ᴠɪᴅᴇᴏ
┃▸ℹ️ ᴅᴏᴡɴʟᴏᴀᴅ ᴠɪᴅᴇᴏ ғʀᴏᴍ ʏᴛ
┃▸ 
┃▸📖 𝐂𝐎𝐌𝐌𝐀𝐍𝐃: .ғʙ
┃▸ℹ️ ᴅᴏᴡɴʟᴏᴀᴅ  ᴠɪᴅᴇᴏ ғʀᴏᴍ ғʙ
┃▸ 
┃▸📖 𝐂𝐎𝐌𝐌𝐀𝐍𝐃: .ᴛᴋ
┃▸ℹ️ ᴅᴏᴡɴʟᴏᴀᴅ ᴠɪᴅᴇᴏ ғʀᴏᴍ ᴛɪᴋᴛᴏᴋ
┃▸ 
┃▸📖 𝐂𝐎𝐌𝐌𝐀𝐍𝐃: .ig
┃▸ℹ️ ᴅᴏᴡɴʟᴏᴀᴅ ᴠɪᴅᴇᴏ ғʀᴏᴍ ɪɢ
┃▸ 
┃▸📖 𝐂𝐎𝐌𝐌𝐀𝐍𝐃: .ɢᴅʀɪᴠᴇ
┃▸ℹ️ ᴅᴏᴡɴʟᴏᴀᴅ ᴅʀɪᴠᴇ ғɪʟᴇs
┃▸ 
┃▸📖 𝐂𝐎𝐌𝐌𝐀𝐍𝐃: .ᴛᴡɪᴛᴛᴇʀ
┃▸ℹ️ ᴅᴏᴡɴʟᴏᴀᴅ ᴠɪᴅᴇᴏ ғʀᴏᴍ ᴛᴡɪᴛᴛᴇʀ
┃▸
┃▸📖 𝐂𝐎𝐌𝐌𝐀𝐍𝐃: .ɪᴍɢ
┃▸ℹ️ ᴅᴏᴡɴʟᴏᴀᴅ ɪᴍᴀɢᴇ
┃▸
┃▸📖 𝐂𝐎𝐌𝐌𝐀𝐍𝐃: .ᴅᴀʀᴀᴍᴀ
┃▸ℹ️ ᴅᴏᴡɴʟᴏᴀᴅ ғᴜʟʟ ᴇᴘɪsᴏᴅᴇ ᴠɪᴅᴇᴏ
┃▸
┃▸📖 𝐂𝐎𝐌𝐌𝐀𝐍𝐃: .ᴘʟᴀʏ2
┃▸ℹ️ ᴅᴏᴡɴʟᴏᴀᴅ ᴀᴜᴅɪᴏ ғʀᴏᴍ ʏᴛ
┃▸ 
┃▸📖 𝐂𝐎𝐌𝐌𝐀𝐍𝐃: .ᴠɪᴅᴇᴏ2
┃▸ℹ️ ᴅᴏᴡɴʟᴏᴀᴅ ᴠɪᴅᴇᴏ ғʀᴏᴍ ʏᴛ
┃▸ 
┃▸📖 𝐂𝐎𝐌𝐌𝐀𝐍𝐃: .ʙᴀɪsᴄᴏᴘᴇ
┃▸ℹ️ ᴅᴏᴡɴʟᴏᴀᴅ ᴠɪᴅᴇᴏ ғʀᴏᴍ ʙᴀɪsᴄᴏᴘᴇ
┃▸ 
┃▸📖 𝐂𝐎𝐌𝐌𝐀𝐍𝐃: .ᴍғɪʀᴇ
┃▸ℹ️ ᴅᴏᴡɴʟᴏᴀᴅ ᴍᴇᴅɪᴀғɪʀᴇ ғɪʟᴇs
╰━━━━━━━━━━━━⪼ 

╭━❮ *𝐀𝐍𝐌𝐈𝐄 𝐂𝐌𝐃* ❯━┈⊷
┃▸
┃▸📖 𝐂𝐎𝐌𝐌𝐀𝐍𝐃: .ʏᴛs
┃▸ℹ️ sᴇʀᴄʜ ᴠɪᴅᴇᴏs ғʀᴏᴍ ʏᴛ
┃▸
┃▸📖 𝐂𝐎𝐌𝐌𝐀𝐍𝐃: .ᴋɪɴɢ
┃▸ℹ️ ɢᴇᴛ ᴋɪɴɢ ᴀʙᴏᴜᴛ 
┃▸
┃▸📖 𝐂𝐎𝐌𝐌𝐀𝐍𝐃: .ᴅᴏɢ
┃▸ℹ️ ɢᴇᴛ ʀᴀɴᴅᴏᴍ ᴅᴏɢ ɪᴍɢs
┃▸
┃▸📖 𝐂𝐎𝐌𝐌𝐀𝐍𝐃: .ᴀɴɪᴍᴇ 
┃▸ℹ️ ɢᴇᴛ ᴀɴɪᴍᴇ ᴘɪᴄs
┃▸
┃▸📖 𝐂𝐎𝐌𝐌𝐀𝐍𝐃: .ᴀɴɪᴍᴇɢɪʀʟ 
┃▸ℹ️ ɢᴇᴛ ᴀɴɪᴍᴇɢɪʀʟ ᴘɪᴄs
┃▸
┃▸📖 𝐂𝐎𝐌𝐌𝐀𝐍𝐃: .ʟᴏʟɪ
┃▸ℹ️ ɢᴇᴛ ʀᴏᴍᴀɴᴛɪᴄ ᴀɴɪᴍᴇ ᴘɪᴄs
╰━━━━━━━━━━━━⪼  

╭━❮‍ *𝐈𝐍𝐅𝐎 𝐂𝐌𝐃* ❯━┈⊷
┃▸
┃▸📖 𝐂𝐎𝐌𝐌𝐀𝐍𝐃: .ᴀʟɪᴠᴇ
┃▸ℹ️ ᴄʜᴇᴄᴋ ᴏɴʟɪɴᴇ ᴏʀ ɴᴏᴛ
┃▸  
┃▸📖 𝐂𝐎𝐌𝐌𝐀𝐍𝐃: .ᴘɪɴɢ
┃▸ℹ️ ᴄʜᴇᴄᴋ ʙᴏᴛ sᴘᴇᴇᴅ
┃▸  
┃▸📖 𝐂𝐎𝐌𝐌𝐀𝐍𝐃: .ᴍᴇɴᴜ
┃▸ℹ️ ɴᴇʀᴏ ᴍᴀɪɴ ᴍᴇɴᴜ
┃▸
┃▸📖 𝐂𝐎𝐌𝐌𝐀𝐍𝐃: .ᴍᴇɴᴜ2
┃▸ℹ️ ɴᴇʀᴏ ᴍᴀɪɴ ᴍᴇɴᴜ2
┃▸ 
┃▸📖 𝐂𝐎𝐌𝐌𝐀𝐍𝐃: .ᴀɪ
┃▸ℹ️ ᴄʜᴀᴛ ᴡɪᴛʜ ᴀɪ ʙᴏᴛ
┃▸
┃▸📖 𝐂𝐎𝐌𝐌𝐀𝐍𝐃: .sʏsᴛᴇᴍ
┃▸ℹ️ ᴄʜᴇᴄᴋ ʙᴏᴛ sʏsᴛᴇᴍs
┃▸
┃▸📖 𝐂𝐎𝐌𝐌𝐀𝐍𝐃: .ᴏᴡɴᴇʀ
┃▸ℹ️ ɢᴇᴛ ᴏᴡɴᴇʀ ɪɴғᴏ
┃▸ 
┃▸📖 𝐂𝐎𝐌𝐌𝐀𝐍𝐃: .sᴛᴀᴛᴜs
┃▸ℹ️ ᴄʜᴇᴄᴋ ʙᴏᴛ ʀᴜɴᴛɪᴍᴇ
┃▸
┃▸📖 𝐂𝐎𝐌𝐌𝐀𝐍𝐃: .ᴀʙᴏᴜᴛ 
┃▸ℹ️ ɢᴇᴛ ᴀʙᴏᴜᴛ ʙᴏᴛ 
┃▸
┃▸📖 𝐂𝐎𝐌𝐌𝐀𝐍𝐃: .ʟɪsᴛ 
┃▸ℹ️ ɢᴇᴛ ʙᴏᴛ ᴄᴏᴍᴍᴀɴᴅ ʟɪsᴛ
┃▸
┃▸📖 𝐂𝐎𝐌𝐌𝐀𝐍𝐃: .sᴄʀɪᴘᴛ 
┃▸ℹ️ ɢᴇᴛ ʙᴏᴛ ʀᴇᴘᴏsɪᴛᴏʀʏ 
╰━━━━━━━━━━━━⪼

╭━❮ *𝐎𝐓𝐇𝐄𝐑 𝐂𝐌𝐃* ❯━┈⊷
┃▸
┃▸📖 𝐂𝐎𝐌𝐌𝐀𝐍𝐃: .ᴊᴏᴋᴇ 
┃▸ℹ️ ɢᴇᴛ ʀᴇɴᴅᴏᴍ ᴊᴏᴋᴇ 
┃▸ 
┃▸📖 𝐂𝐎𝐌𝐌𝐀𝐍𝐃: .ғᴀᴄᴛ
┃▸ℹ️ ɢᴇᴛ ʀᴇɴᴅᴏᴍ ғᴀᴄᴛ
┃▸
┃▸📖 𝐂𝐎𝐌𝐌𝐀𝐍𝐃: .ɢɪᴛʜᴜʙsᴛᴀʟᴋ 
┃▸ℹ️ ɢᴇᴛ ɢɪᴛʜᴜʙ ᴅᴀᴛᴀ ᴀɴʏ ᴜsᴇʀ
┃▸ 
┃▸📖 𝐂𝐎𝐌𝐌𝐀𝐍𝐃: .ɢᴘᴀss
┃▸ℹ️ ɢᴇᴛ ᴀ sᴛʀᴏɴɢ ᴘᴀssᴡᴏʀᴅ 
┃▸
┃▸📖 𝐂𝐎𝐌𝐌𝐀𝐍𝐃: .ʜᴀᴄᴋ
┃▸ℹ️ ᴘʀᴀɴᴋ ᴡɪᴛʜ ғʀɪᴇɴᴅs 
┃▸
┃▸📖 𝐂𝐎𝐌𝐌𝐀𝐍𝐃: .sʀᴇᴘᴏ 
┃▸ℹ️ sᴇʀᴄʜ ʀᴇᴘᴏsɪᴛᴏʀʏ 
┃▸
┃▸📖 𝐂𝐎𝐌𝐌𝐀𝐍𝐃: .ᴅᴇғɪɴᴇ 
┃▸ℹ️ sᴇʀᴄʜ ᴀɴʏ ᴡᴏʀᴅs
╰━━━━━━━━━━━━⪼

╭━❮ *𝐆𝐑𝐎𝐔𝐏 𝐂𝐌𝐃* ❯━┈⊷
┃▸
┃▸📖 𝐂𝐎𝐌𝐌𝐀𝐍𝐃: .ᴍᴜᴛᴇ
┃▸ℹ️ ᴍᴜᴛᴇ ɢʀᴏᴜᴘ
┃▸
┃▸📖 𝐂𝐎𝐌𝐌𝐀𝐍𝐃: .ᴜɴᴍᴜᴛᴇ
┃▸ℹ️ ᴜɴᴍᴜᴛᴇ ɢʀᴏᴜᴘ
┃▸
┃▸📖 𝐂𝐎𝐌𝐌𝐀𝐍𝐃: .ʟᴇғᴛ
┃▸ℹ️ ʟᴇғᴛ ɢʀᴏᴜᴘ
┃▸
┃▸📖 𝐂𝐎𝐌𝐌𝐀𝐍𝐃: .ᴊɪᴅ
┃▸ℹ️ ɢʀᴏᴜᴘ ᴊɪᴅ
┃▸
┃▸📖 𝐂𝐎𝐌𝐌𝐀𝐍𝐃: .ʀᴇᴍᴏᴠᴇ
┃▸ℹ️ ʀᴇᴍᴏᴠᴇ ᴍᴇᴍʙᴇʀ ғʀᴏᴍ ɢʀᴏᴜᴘ
┃▸
┃▸📖 𝐂𝐎𝐌𝐌𝐀𝐍𝐃: .ᴅᴇʟᴇᴛᴇ 
┃▸ℹ️ ʀᴇᴍᴏᴠᴇ sms ғʀᴏᴍ ɢʀᴏᴜᴘ 
┃▸
┃▸📖 𝐂𝐎𝐌𝐌𝐀𝐍𝐃: .ᴀᴅᴅ
┃▸ℹ️ ᴀᴅᴅ ᴍᴇᴍʙᴇʀs ɪɴ ɢʀᴏᴜᴘ 
┃▸
┃▸📖 𝐂𝐎𝐌𝐌𝐀𝐍𝐃: .ᴋɪᴄᴋ
┃▸ℹ️ ᴋɪᴄᴋ ᴀɴʏ ᴜsᴇʀ 
┃▸
┃▸📖 𝐂𝐎𝐌𝐌𝐀𝐍𝐃: .ᴋɪᴄᴋᴀʟʟ
┃▸ℹ️ ʀᴇᴍᴏᴠᴇ ᴀʟʟ ᴍᴇᴍʙᴇʀs ғʀᴏᴍ ɢʀᴏᴜᴘ
┃▸
┃▸📖 𝐂𝐎𝐌𝐌𝐀𝐍𝐃: .sᴇᴛɢᴏᴏᴅʙʏᴇ
┃▸ℹ️ sᴇᴛ ᴍᴇᴍʙᴇʀ ʟᴇᴀᴠᴇ sᴍs
┃▸
┃▸📖 𝐂𝐎𝐌𝐌𝐀𝐍𝐃: .sᴇᴛᴡᴇʟᴄᴏᴍᴇ 
┃▸ℹ️ sᴇᴛ ᴍᴇᴍʙᴇʀ ᴡᴇʟᴄᴏᴍᴇ sᴍs
┃▸
┃▸📖 𝐂𝐎𝐌𝐌𝐀𝐍𝐃: ᴘʀᴏᴍᴏᴛᴇ 
┃▸ℹ️ ᴍᴀᴋᴇ ɢʀᴏᴜᴘ ᴀᴅᴍɪɴ
┃▸
┃▸📖 𝐂𝐎𝐌𝐌𝐀𝐍𝐃: .ᴅᴇᴍᴏᴛᴇ 
┃▸ℹ️ ᴅɪssᴍɪs ᴀɴʏ ᴀᴅᴍɪɴ 
┃▸
┃▸📖 𝐂𝐎𝐌𝐌𝐀𝐍𝐃: .ᴛᴀɢᴀʟʟ
┃▸ℹ️ ᴍᴇɴᴛɪᴏɴ ɢʀᴏᴜᴘ ᴀʟʟ ᴍᴇᴍʙᴇʀs
┃▸
┃▸📖 𝐂𝐎𝐌𝐌𝐀𝐍𝐃: .ɢᴇᴛᴘɪᴄ
┃▸ℹ️ ɢᴇᴛ ɢʀᴏᴜᴘ ᴘʀᴏғɪʟᴇ
┃▸
┃▸📖 𝐂𝐎𝐌𝐌𝐀𝐍𝐃: .ɪɴᴠɪᴛᴇ 
┃▸ℹ️ ɢᴇᴛ ɢʀᴏᴜᴘ ɪɴᴠɪᴛᴇ ʟɪɴᴋ
┃▸
┃▸📖 𝐂𝐎𝐌𝐌𝐀𝐍𝐃: .ʀᴇᴠᴏᴋᴇ 
┃▸ℹ️ ʀᴇsᴇᴛ ɢʀᴏᴜᴘ ʟɪɴᴋ
┃▸
┃▸📖 𝐂𝐎𝐌𝐌𝐀𝐍𝐃: .ᴊᴏɪɴʀᴇǫᴜᴇsᴛs
┃▸ℹ️ ᴄʜᴇᴀᴄᴋ ɢʀᴏᴜᴘ ᴘᴀɴᴅɪɴɢ ᴍᴇᴍʙᴇʀs
┃▸
┃▸📖 𝐂𝐎𝐌𝐌𝐀𝐍𝐃: .ᴀʟʟʀᴇǫ
┃▸ℹ️ ᴀᴅᴅ ɢʀᴏᴜᴘ ᴘᴀɴᴅɪɴɢ ᴍᴇᴍʙᴇʀs 
┃▸
┃▸📖 𝐂𝐎𝐌𝐌𝐀𝐍𝐃: .lockgc
┃▸ℹ️ ʟᴏᴄᴋ ɢʀᴏᴜᴘ ᴘʀɪᴠᴀᴛᴇ
┃▸
┃▸📖 𝐂𝐎𝐌𝐌𝐀𝐍𝐃: .ᴜɴʟᴏᴄᴋɢᴄ
┃▸ℹ️ ᴜɴʟᴏᴄᴋ ɢʀᴏᴜᴘ ᴀʟʟ
┃▸
┃▸📖 𝐂𝐎𝐌𝐌𝐀𝐍𝐃: .ʟᴇᴀᴠᴇ 
┃▸ℹ️ ʟᴇғᴛ ᴀɴʏ ɢʀᴏᴜᴘ 
┃▸
┃▸📖 𝐂𝐎𝐌𝐌𝐀𝐍𝐃: .ᴜᴘᴅᴀᴛᴇɢɴᴀᴍᴇ
┃▸ℹ️ sᴇᴛ ɢʀᴏᴜᴘ ɴᴀᴍᴇ
┃▸
┃▸📖 𝐂𝐎𝐌𝐌𝐀𝐍𝐃: .ᴜᴘᴅᴀᴛᴇɢᴅᴇsᴄ
┃▸ℹ️ sᴇᴛ ɢʀᴏᴜᴘ ᴅᴇsᴄʀɪᴘᴛɪᴏɴ 
┃▸
┃▸📖 𝐂𝐎𝐌𝐌𝐀𝐍𝐃: .ᴊᴏɪᴍ
┃▸ℹ️ ᴊᴏɪɴ ɪɴᴠɪᴛᴇ ʟɪɴᴋ 
┃▸
┃▸📖 𝐂𝐎𝐌𝐌𝐀𝐍𝐃: .ʜɪᴅᴇᴛᴀɢ
┃▸ℹ️ ᴍᴇɴᴛɪᴏɴ ᴀɴʏ ᴜsᴇʀ ʜɪᴅᴇ
┃▸
┃▸📖 𝐂𝐎𝐌𝐌𝐀𝐍𝐃: .ɢɪɴғᴏ
┃▸ℹ️ ɢᴇᴛ ɢʀᴏᴜᴘ ɪɴғᴏʀᴍᴀᴛɪᴏɴ 
┃▸
┃▸📖 𝐂𝐎𝐌𝐌𝐀𝐍𝐃: .ᴅɪsᴀᴘᴘᴇᴀʀ ᴏɴ
┃▸ℹ️ ᴏɴ ᴅɪsᴀᴘᴘᴇᴀʀ sᴍs ɪɴ group 
┃▸
┃▸📖 𝐂𝐎𝐌𝐌𝐀𝐍𝐃: .ᴅɪsᴀᴘᴘᴇᴀʀ ᴏғғ
┃▸ℹ️ ᴏғғ ᴅɪsᴀᴘᴘᴇᴀʀ sᴍs ɪɴ ɢʀᴏᴜᴘ 
┃▸
┃▸📖 𝐂𝐎𝐌𝐌𝐀𝐍𝐃: .sᴇɴᴅᴅᴍ
┃▸ℹ️ sᴇɴᴅ ᴅɪsᴀᴘᴘᴇᴀʀ sᴍs ɪɴ ɢʀᴏᴜᴘ 
┃▸
┃▸📖 𝐂𝐎𝐌𝐌𝐀𝐍𝐃: .ᴅɪsᴀᴘᴘᴇᴀʀ 7ᴅ 24ʜ 90ᴅ
┃▸ℹ️ sᴇᴛ ᴛɪᴍᴇ ᴛᴏ ᴅɪsᴀᴘᴘᴇᴀʀ sᴍs
╰━━━━━━━━━━━━⪼

╭━❮ *𝐎𝐖𝐍𝐄𝐑 𝐂𝐌𝐃* ❯━┈⊷
┃▸
┃▸📖 𝐂𝐎𝐌𝐌𝐀𝐍𝐃: .ᴜᴘᴅᴀᴛᴇ
┃▸ℹ️ ᴜᴘᴅᴀᴛᴇ ʙᴏᴛ ᴠᴇʟᴜᴇ 
┃▸
┃▸📖 𝐂𝐎𝐌𝐌𝐀𝐍𝐃: .ʀᴇsᴛᴀʀᴛ 
┃▸ℹ️ ʀᴇsᴛᴀʀᴛ ʏᴏᴜʀ ʙᴏᴛ
┃▸
┃▸📖 𝐂𝐎𝐌𝐌𝐀𝐍𝐃: .sᴇᴛᴛɪɴɢs
┃▸ℹ️ sᴇᴇ ʙᴏᴛ sᴇᴛᴛɪɴɢs
┃▸
┃▸📖 𝐂𝐎𝐌𝐌𝐀𝐍𝐃: .ᴏᴡɴᴇʀ 
┃▸ℹ️ ɢᴇᴛ ᴏᴡɴᴇʀ ɴᴜᴍʙᴇʀ 
┃▸
┃▸📖 𝐂𝐎𝐌𝐌𝐀𝐍𝐃: .ʀᴇᴘᴏ 
┃▸ℹ️ ɢᴇᴛ ʙᴏᴛ ʀᴇᴘᴏsɪᴛᴏʀʏ 
┃▸
┃▸📖 𝐂𝐎𝐌𝐌𝐀𝐍𝐃: .sʏsᴛᴇᴍ 
┃▸ℹ️ ᴄʜᴇᴄᴋ ʙᴏᴛ sʏsᴛᴇᴍs
┃▸
┃▸📖 𝐂𝐎𝐌𝐌𝐀𝐍𝐃: .ʙʟᴏᴄᴋ
┃▸ℹ️ ʙʟᴏᴄᴋ ᴀɴʏ ᴜsᴇʀ 
┃▸
┃▸📖 𝐂𝐎𝐌𝐌𝐀𝐍𝐃: .ᴜɴʙʟᴏᴄᴋ 
┃▸ℹ️ ᴜɴʙʟᴏᴄᴋ ᴀɴʏ ᴜsᴇʀ 
┃▸
┃▸📖 𝐂𝐎𝐌𝐌𝐀𝐍𝐃: .sʜᴜᴛᴅᴏᴡɴ 
┃▸ℹ️ ʟᴏɢᴏᴜᴛ ʏᴏᴜʀ ʙᴏᴛ
┃▸
┃▸📖 𝐂𝐎𝐌𝐌𝐀𝐍𝐃: .ᴄʟᴇᴀʀᴄʜᴀᴛs 
┃▸ℹ️ ᴄʟᴇᴀʀᴄʜᴀᴛs ғʀᴏᴍ ɪʙ
┃▸
┃▸📖 𝐂𝐎𝐌𝐌𝐀𝐍𝐃: .sᴇᴛᴘᴘ
┃▸ℹ️ ᴜᴘᴅᴀᴛᴇ ᴘʀᴏғɪʟᴇ ᴘɪᴄ
┃▸
┃▸📖 𝐂𝐎𝐌𝐌𝐀𝐍𝐃: .ʙʀᴏᴀᴅᴄᴀsᴛ 
┃▸ℹ️ ᴄʀᴇᴀᴛ ʙʀᴏᴀᴅᴄᴀsᴛ 
┃▸
┃▸📖 𝐂𝐎𝐌𝐌𝐀𝐍𝐃: .ᴊɪᴅ
┃▸ℹ️ ɢᴇᴛ ᴊɪᴅ ᴀɴʏ ᴜsᴇʀ
┃▸
┃▸📖 𝐂𝐎𝐌𝐌𝐀𝐍𝐃: .ɢᴊɪᴅ 
┃▸ℹ️ ɢᴇᴛ ɢʀᴏᴜᴘ ᴊɪᴅ
╰━━━━━━━━━━━━⪼

╭━❮ *𝐂𝐎𝐍𝐕𝐄𝐑𝐓 𝐂𝐌𝐃* ❯━┈⊷
┃▸
┃▸📖 𝐂𝐎𝐌𝐌𝐀𝐍𝐃: .sᴛɪᴄᴋᴇʀ
┃▸ℹ️ ᴄᴏɴᴠᴇʀᴛ ᴘʜᴏᴛᴏ ᴛᴏ sᴛɪᴄᴋᴇʀ
┃▸
┃▸📖 𝐂𝐎𝐌𝐌𝐀𝐍𝐃: .ᴛᴛs
┃▸ℹ️ ᴄʜᴀɴɢᴇ ᴛᴇxᴛ ᴛᴏ ᴠᴏɪᴄᴇ 
┃▸
┃▸📖 𝐂𝐎𝐌𝐌𝐀𝐍𝐃: .ᴛʀᴛ 
┃▸ℹ️ ᴄʜᴀɴɢᴇ ʟᴀɴɢᴜᴀɢᴇs 
╰━━━━━━━━━━━━⪼
>  *ᴘᴏᴡᴇʀᴇᴅ ʙʏ 𓄂𝕚𝕥𝕩.𝑺𝑯𝑬𝑰𝑲𝑯 𝑨𝑳𝑰 🔥༽༼*`;

        await conn.sendMessage(
            from,
            {
                image: { url: `https://i.ibb.co/hVndwHm/6995.jpg` },
                caption: dec,
                contextInfo: {
                    mentionedJid: [m.sender],
                    forwardingScore: 999,
                    isForwarded: true,
                    forwardedNewsletterMessageInfo: {
                        newsletterJid: '120363369260614615@newsletter',
                        newsletterName: 'SHEIKH-ALI-MD,
                        serverMessageId: 143
                    }
                }
            },
            { quoted: mek }
        );

        // Send audio
        await conn.sendMessage(from, {
            audio: { url: 'https://github.com/JawadYTX/KHAN-DATA/raw/refs/heads/main/autovoice/sigma.m4a' },
            mimetype: 'audio/mp4',
            ptt: true
        }, { quoted: mek });
        
    } catch (e) {
        console.log(e);
        reply(`${e}`);
    }
});