const config = require('../config')
const {cmd , commands} = require('../command')
const os = require("os")
const {runtime} = require('../lib/functions')
const axios = require('axios')

cmd({

    pattern: "menu",

    react: "🛸",

    alias: ["panel","commands"],

    desc: "Get bot\'s command list.",

    category: "main",

    use: '.menu',

    filename: __filename

},

async(conn, mek, m,{from, l, quoted, body, isCmd, umarmd, args, q, isGroup, sender, senderNumber, botNumber2, botNumber, pushname, isMe, isOwner, groupMetadata, groupName, participants, groupAdmins, isBotAdmins, isAdmins, reply}) => {

try{
let madeMenu = `╭━━━━∙⋆⋅⋆∙━ ─┉─ • ─┉─⊷

*⇆ ʜɪɪ ᴍʏ ᴅᴇᴀʀ ғʀɪᴇɴᴅ ⇆*

     *${pushname}*
     
╰━━━━∙⋆⋅⋆∙━ ─┉─ • ─┉─⊷
┏━━━━━━━━━━━━━━━━━━━━━━━━━━
      *ᴡᴇʟᴄᴏᴍᴇ ᴛᴏ ꜱʜᴇɪᴋʜ-ᴀʟɪ-ᴍᴅ ғᴜʟʟ ᴄᴏᴍᴍᴀɴᴅ ʟɪsᴛ*
┗━━━━━━━━━━━━━━━━━━━━━━━━━━

*© ᴄʀᴇᴀᴛᴇᴅ ʙʏ ᴀʟɪ ᴀʜᴍᴀᴅ···²⁴⁰⁶*

*┏━━┫${config.BOT_NAME}┣━━✾*
*┃╭───────────────✑*
*┻│▸*
*❖│▸* *ʀᴜɴᴛɪᴍᴇ* : ${runtime(process.uptime())}
*❖│▸* *ᴍᴏᴅᴇ* : *[${config.MODE}]*
*❖│▸* *ᴘʀᴇғɪx* : *[${config.PREFIX}]*
*❖│▸* *ʀᴀᴍ ᴜsᴇ* : ${(process.memoryUsage().heapUsed / 1024 / 1024).toFixed(2)}MB / ${Math.round(require('os').totalmem / 1024 / 1024)}MB
*❖│▸* *ɴᴀᴍᴇ ʙᴏᴛ* : *❖ꜱʜᴇɪᴋʜ-ᴀʟɪ-ᴍᴅ❖*
*❖│▸* *ᴄʀᴇᴀᴛᴏʀ* : *𝐀𝐋𝐈 𝐀𝐇𝐌𝐀𝐃•••²⁴⁰⁶*
*❖│▸* *ᴠᴇʀsɪᴏɴs* : *ᴠ.1.0.0*
*❖│▸* *ᴍᴇɴᴜ ᴄᴍᴅ* : *ᴍᴇɴᴜ*
*┳│▸*
*┃╰───────────────✑*
*┗━━━━━━━━━━━━━━━━━━━✑*
*♡︎•━━━━━━︎🏴‍☠️━━━━━━•♡*

*◉┌─〈 *⚬𝐃𝐎𝐖𝐍𝐋𝐎𝐀𝐃-𝐂𝐌𝐃⚬* 〉─◆*
*◉┋* *.ғᴀᴄᴇʙᴏᴏᴋ <ᴜʀʟ>*
*◉┋* *.ɪɴꜱᴛᴀɢʀᴀɴ <ᴜʀʟ>*
*◉┋* *.ᴠɪᴅᴇᴏ <ᴜʀʟ>*
*◉┋* *.ɢᴅʀɪᴠᴇ <ᴜʀʟ>*
*◉┋* *.ᴛᴡɪᴛᴛᴇʀ <ᴜʀʟ>*
*◉┋* *.ᴛɪᴋᴛᴏᴋ <ᴜʀʟ>*
*◉┋* *.ᴍᴇᴅɪᴀғɪʀᴇ <ᴜʀʟ>*
*◉┋* *.ꜱᴏɴɢ <ϙᴜᴇʀʏ>*
*◉┋* *.ᴘʟᴀʏ <ᴜʀʟ>*
*◉┋* *.ᴠɪᴅᴇᴏ <ϙᴜᴇʀʏ>*
*◉┋* *.ᴠɪᴅᴇᴏ2 <ᴜʀʟ>*
*◉┋* *.ɪᴍɢ <ϙᴜᴇʀʏ>*
*◉┋* *.ᴀᴘᴘᴘʟɪᴄᴀᴛɪᴏɴ <ɴᴀᴍᴇ>*
*◉┋* *.ᴅᴀʀᴀᴍᴀ <ᴛɪᴛᴛʟᴇ>*
*◉┋* *.ᴘʟᴀʏ2 <ᴛɪᴛᴛʟᴇ>*
*◉┋* *.ʙᴀɪsᴄᴏᴘᴇ <ᴜʀʟ>*
*◉┋* *.ɢɪɴɪsɪsɪʟᴀ <ᴛɪᴛᴛʟᴇ>*
*◉╰┈───────────────•⟢*

*◉┌─〈 *⚬𝐒𝐄𝐀𝐑𝐂𝐇-𝐂𝐌𝐃⚬* 〉─◆*
*◉┋* *.ʏᴛꜱ  <ᴛᴇxᴛ>*
*◉┋* *.ʏᴛᴀ <ᴜʀʟ>*
*◉┋* *.ʟᴏʟɪ <ᴛᴇxᴛ>*
*◉┋* *.ᴍᴏᴠɪᴇɪɴғᴏ <ᴛᴇxᴛ>*
*◉┋* *.ɪᴍɢ <ᴛᴇxᴛ>*
*◉┋* *.ᴡᴇᴀᴛʜᴇʀ <ᴄɪᴛʏ>*
*◉╰┈───────────────•⟢*

*◉┌─〈 *⚬𝐀𝐈-𝐂𝐌𝐃⚬* 〉─◆*
*◉┋* *.ɢᴘᴛ <ᴛᴇxᴛ>*
*◉┋* *.ᴀɪ <ᴛᴇxᴛ>*
*◉┋* *.ʙᴏᴛ <ᴛᴇxᴛ>*
*◉╰┈───────────────•⟢*

*◉┌─〈 *⚬𝐎𝐖𝐍𝐄𝐑-𝐂𝐌𝐃⚬* 〉─◆*
*◉┋* *.ᴜᴘᴅᴀᴛᴇᴄᴍᴅ*
*◉┋* *.sᴇᴛᴛɪɴɢs*
*◉┋* *.ᴏᴡɴᴇʀ*
*◉┋* *.ʀᴇᴘᴏ*
*◉┋* *.ꜱʏꜱᴛᴇᴍ*
*◉┋* *.ꜱᴛᴀᴛᴜꜱ*
*◉┋* *.ʙʟᴏᴄᴋ*
*◉┋* *.ᴜɴʙʟᴏᴄᴋ*
*◉┋* *.sʜᴜᴛᴅᴏᴡɴ*
*◉┋* *.ᴄʟᴇᴀʀᴄʜᴀᴛs*
*◉┋* *.sᴇᴛᴘᴘ*
*◉┋* *.ʙʀᴏᴀᴅᴄᴀsᴛ*
*◉┋* *.ᴊɪᴅ*
*◉┋* *.ɢᴊɪᴅ*
*◉┋* *.ʀᴇꜱᴛᴀʀᴛ*
*◉╰┈───────────────•⟢*

*◉┌─〈 *⚬𝐆𝐑𝐎𝐔𝐏-𝐂𝐌𝐃⚬* 〉─◆*
*◉┋* *.ʀᴇᴍᴏᴠᴇ <ʀᴇᴘʟʏ ғᴏʀ ᴅᴇʟᴇᴛᴇ sᴍs>*
*◉┋* *.ᴅᴇʟᴇᴛᴇ <ʀᴇᴘʟʏ ғᴏʀ ᴅᴇʟᴇᴛᴇ sᴍs>*
*◉┋* *.ᴀᴅᴅ*
*◉┋* *.ᴋɪᴄᴋ*
*◉┋* *.sᴇᴛɢᴏᴏᴅʙʏᴇ <ᴛᴇxᴛ>*
*◉┋* *.sᴇᴛᴡᴇʟᴄᴏᴍᴇ <ᴛᴇxᴛ>*
*◉┋* *.ᴘʀᴏᴍᴏᴛᴇ*
*◉┋* *.ᴅᴇᴍᴏᴛᴇ*
*◉┋* *.ᴛᴀɢᴀʟʟ*
*◉┋* *.ɢᴇᴛᴘɪᴄ*
*◉┋* *.ɪɴᴠɪᴛᴇ*
*◉┋* *.ʀᴇᴠᴏᴋᴇ*
*◉┋* *.ᴊᴏɪɴʀᴇǫᴜᴇsᴛs*
*◉┋* *.ᴀʟʟʀᴇǫ*
*◉┋* *.ᴍᴜᴛᴇ*
*◉┋* *.ᴜɴᴍᴜᴛᴇ*
*◉┋* *.ʟᴏᴄᴋɢᴄ*
*◉┋* *.ᴜɴʟᴏᴄᴋɢᴄ*
*◉┋* *.ʟᴇᴀᴠᴇ*
*◉┋* *.ᴜᴘᴅᴀᴛᴇɢɴᴀᴍᴇ*
*◉┋* *.ᴜᴘᴅᴀᴛᴇɢᴅᴇsᴄ*
*◉┋* *.ᴊᴏɪɴ*
*◉┋* *.ʜɪᴅᴇᴛᴀɢ*
*◉┋* *.ɢɪɴғᴏ*
*◉┋* *.ᴅɪsᴀᴘᴘᴇᴀʀ ᴏɴ*
*◉┋* *.ᴅɪsᴀᴘᴘᴇᴀʀ ᴏғғ*
*◉┋* *.ᴅɪsᴀᴘᴘᴇᴀʀ 7ᴅ 24ʜ 90ᴅ*
*◉┋* *.sᴇɴᴅᴅᴍ*
*◉╰┈───────────────•⟢*

*◉┌─〈 *⚬𝐈𝐍𝐅𝐎-𝐂𝐌𝐃⚬* 〉─◆*
*◉┋* *.ꜱʜᴇɪᴋʜ1*
*◉┋* *.ꜱʜᴇɪᴋʜ2*
*◉┋* *.ꜱʜᴇɪᴋʜ3*
*◉┋* *.ᴀʙᴏᴜᴛ*
*◉┋* *.sᴄʀɪᴘᴛ*
*◉┋* *.ʀᴇᴘᴏ*
*◉┋* *.ᴀʟɪᴠᴇ*
*◉┋* *.ʙᴏᴛɪɴꜰᴏ*
*◉┋* *.ꜱᴛᴀᴛᴜꜱ*
*◉┋* *.ꜱᴜᴘᴘᴏʀᴛ*
*◉┋* *.ᴘɪɴɢ*
*◉┋* *.ᴘɪɴɢ2*
*◉┋* *.ꜱʏꜱᴛᴇᴍ*
*◉╰┈───────────────•⟢*

*◉┌─〈 *⚬𝐂𝐎𝐍𝐕𝐄𝐑𝐓-𝐂𝐌𝐃⚬* 〉─◆*
*◉┋* *.sᴛɪᴄᴋᴇʀ*
*◉┋* *.ᴛʀᴛ <ᴛᴇxᴛ>*
*◉┋* *.ᴛᴛs <ᴛᴇxᴛ>*
*◉╰┈───────────────•⟢*

*◉┌─〈 *⚬𝐑𝐀𝐍𝐃𝐎𝐌-𝐂𝐌𝐃⚬* 〉─◆*
*◉┋* *.ᴋɪɴɢ*
*◉┋* *.ᴅᴏɢ*
*◉┋* *.ᴀɴɪᴍᴇ*
*◉┋* *.ᴀɴɪᴍᴇɢɪʀʟ*
*◉┋* *.ᴀɴɪᴍᴇɢɪʀʟ1*
*◉┋* *.ᴀɴɪᴍᴇɢɪʀʟ2*
*◉┋* *.ᴀɴɪᴍᴇɢɪʀʟ3*
*◉┋* *.ᴀɴɪᴍᴇɢɪʀʟ4*
*◉┋* *.ᴀɴɪᴍᴇɢɪʀʟ5*
*◉╰┈───────────────•⟢*

*◉┌─〈 *⚬𝐖𝐀𝐋𝐋𝐏𝐀𝐏𝐄𝐑-𝐂𝐌𝐃⚬* 〉─◆*
*◉┋* *.ɪᴍɢ*
*◉╰┈───────────────•⟢*

*◉┌─〈 *⚬𝐎𝐓𝐇𝐄𝐑-𝐂𝐌𝐃⚬* 〉─◆*
*◉┋* *.ᴛʀᴛ*
*◉┋* *.ᴊᴏᴋᴇ*
*◉┋* *.ꜰᴀᴄᴛ*
*◉┋* *.ɢɪᴛʜᴜʙꜱᴛᴀʟᴋ*
*◉┋* *.ɢᴘᴀꜱꜱ*
*◉┋* *.ʜᴀᴄᴋ*
*◉┋* *.ǫᴜᴏᴛᴇ*
*◉┋* *.ꜱʀᴇᴘᴏ*
*◉┋* *.ᴅᴇꜰɪɴᴇ*
*◉╰┈───────────────•⟢*


*♡︎•━━━━━━︎🏴‍☠️━━━━━━•♡*

┏━━━━━━━━━━━━━━━━━━◆
 *https://chat.whatsapp.com/BobH0xeN4YQ6QAMELpk4i0*
┗━━━━━━━━━━━━━━━━━━◆

*╭─────────────────•⟢*
 > © ᴘᴏᴡᴇʀᴇᴅ ʙʏ 𓄂𝕚𝕥𝕩.𝑺𝑯𝑬𝑰𝑲𝑯 𝑨𝑳𝑰 🔥༽༼
*╰─────────────────•⟢*
`

await conn.sendMessage(from,{image:{url:config.ALIVE_IMG},caption:madeMenu},{quoted:mek})

}catch(e){
console.log(e)
reply(`${e}`)
}
})
